cases/chpt4-tin-solid-507-liq/0/ElPot
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      ElPot;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;  

boundaryField
{
    hot
    {
//      type   fixedValue;
//      value uniform 5;
      type zeroGradient;
    } 
    cold
    {
//      type   fixedValue;
//      value uniform 0;
      type zeroGradient;
    }
    top
    {
      type zeroGradient;
    }
    btm
    {
      type zeroGradient;
    }
    front
    {
        type        empty;
    }
    back
    {
        type        empty;
    }
    hotTop
    {
        $hot;
    }
    coldTop
    {
        $cold;
    }
}           

// ************************************************************************* //
